Revit 2026 API

# TextElementBackground Enumeration

---

An enumerated type listing all the background mode for the built-in parameter TEXT_BACKGROUND.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum TextElementBackground
```
```vb
Public Enumeration TextElementBackground
```
```cpp
public enum class TextElementBackground
```
```fsharp
type TextElementBackground
```

| Member name | Value | Description |
| --- | --- | --- |
| TBGR_OPAQUE | 0 | The TextElement object is opaque. |
| TBGR_TRANSPARENT | 1 | The TextElement object is transparent. |

#### Reference

Autodesk.Revit.DB Namespace